In [10]:
import pandas as pd
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],     #1st dataframe
    "temperature": [21,14,35],
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [2]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],     #2nd dataframe
    "humidity": [65,68,75],
})
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

In [3]:
df3 = pd.merge(df1,df2,on='city')                  #merging two dataframe based on 'city'
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

## suppose we have uncommon values in the two datasets then it will not merge, it will only  merge the common elements which are present in the inner join of the two dataframes(set theory) .....so in order to join them, we have to mention 
                                            df3 = pd.merge(df1,df2,on='city',how = 'outer')
## so that we will get all the values from both the dataframes, inner as well as outer

In [12]:
df4 = pd.DataFrame({
    "city": ["new york","chicago","orlando", 'baltimore'],     #1st dataframe
    "temperature": [21,14,35,23],
})
df4

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           23

In [17]:
df5 = pd.DataFrame({
    "city": ["chicago","new york","sanfrancisco"],                   #2nd dataframe
    "humidity": [65,68,75]
})
df5

           city  humidity
0       chicago        65
1      new york        68
2  sanfrancisco        75

In [19]:
df6 = pd.merge(df4,df5,on='city', how='outer')   #use of how='outer' ...but bydefault if we dont specify then its how='inner'
df6

           city  temperature  humidity
0      new york         21.0      68.0
1       chicago         14.0      65.0
2       orlando         35.0       NaN
3     baltimore         23.0       NaN
4  sanfrancisco          NaN      75.0

## to get the values from only left side or only right side, we can specify 
                                                       how='left' or how='right'

## so to know from which side the data came from, we have indicator

In [21]:
df6 = pd.merge(df4,df5,on='city', how = 'outer', indicator = True)  #use of indicator to know which side the data belongs to
df6

           city  temperature  humidity      _merge
0      new york         21.0      68.0        both
1       chicago         14.0      65.0        both
2       orlando         35.0       NaN   left_only
3     baltimore         23.0       NaN   left_only
4  sanfrancisco          NaN      75.0  right_only

## SUFFIXES

In [22]:
df7 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35,38],
    "humidity": [65,68,71, 75]
})
df7

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [23]:
df8 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "temperature": [21,14,35],
    "humidity": [65,68,71]
})
df8

        city  temperature  humidity
0    chicago           21        65
1   new york           14        68
2  san diego           35        71

In [26]:
df9 = pd.merge(df7,df8,on='city',how = 'outer', suffixes=('_first','_second'))
df9

,city,temperature_first,humidity_first,temperature_second,humidity_second
0,new york,21.0,65.0,14.0,68.0
1,chicago,14.0,68.0,21.0,65.0
2,orlando,35.0,71.0,NaN,NaN
3,baltimore,38.0,75.0,NaN,NaN
4,san diego,NaN,NaN,35.0,71.0

## so to specify two same values in the same cities but different dataframe we need to give suffixes so that we will know which column belongs to which dataframe(first/second)

## JOIN

In [27]:
df10 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df10.set_index('city',inplace=True)
df10

          temperature
city
new york           21
chicago            14
orlando            35

In [29]:
df11 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df11.set_index('city',inplace=True)
df11

          humidity
city
chicago         65
new york        68
orlando         75

In [30]:
df10.join(df11,lsuffix='_l', rsuffix='_r')

          temperature  humidity
city
new york           21        68
chicago            14        65
orlando            35        75